In [1]:
# Add Matplotlib inline magic command
%matplotlib inline
# Dependencies and Setup
import matplotlib.pyplot as plt
import pandas as pd

In [2]:
# Files to load
city_data_to_load="Resources/city_data.csv"
ride_data_toLoad="Resources/ride_data.csv"

In [4]:
# Read the city data file and store it in a pandas DataFrame.
city_data_df = pd.read_csv(city_data_to_load)
city_data_df.head()

           city  driver_count   type
0   Richardfort            38  Urban
1  Williamsstad            59  Urban
2   Port Angela            67  Urban
3    Rodneyfort            34  Urban
4   West Robert            39  Urban

In [5]:
ride_data_df = pd.read_csv(ride_data_toLoad)
ride_data_df.head()

                 city                 date   fare        ride_id
0  Lake Jonathanshire  2019-01-14 10:14:22  13.83  5739410935873
1  South Michelleport  2019-03-04 18:24:09  30.24  2343912425577
2  Port Samanthamouth  2019-02-24 04:29:00  33.44  2005065760003
3          Rodneyfort  2019-02-10 23:22:03  23.44  5149245426178
4          South Jack  2019-03-06 04:28:35  34.58  3908451377344

In [14]:
# Get the columns and the rows that are not null.
city_data_df.count()
#or
#city_data_df.isnull().sum()

city            120
driver_count    120
type            120
dtype: int64

In [19]:
# Get the data types of each column.
city_data_df.dtypes

city            object
driver_count     int64
type            object
dtype: object

In [31]:
# Get the number of data points(cities) there are for each type of city
city_data_df.groupby(["type"])["city"].count()

array(['Urban', 'Suburban', 'Rural'], dtype=object)

In [32]:
#or Module 5 way
# Get the unique values of the type of city.
city_data_df["type"].unique()

array(['Urban', 'Suburban', 'Rural'], dtype=object)

In [33]:
#or Module 5 way
# Get the number of data points from the Urban cities.
sum(city_data_df["type"]=="Urban")

66

In [34]:
#or Module 5 way
# Get the number of data points from the Suburban cities.
sum(city_data_df["type"]=="Suburban")

36

In [35]:
#or Module 5 way
# Get the number of data points from the Rural cities.
sum(city_data_df["type"]=="Rural")

18

In [38]:
# Get the columns and the rows that are not null. 
ride_data_df.isnull().sum()
# Or ride_data_df.count()

city       0
date       0
fare       0
ride_id    0
dtype: int64

In [41]:
ride_data_df.dtypes

city        object
date        object
fare       float64
ride_id      int64
dtype: object

In [45]:
# new_df = pd.merge(leftdf, rightdf, on=["column_leftdf", "column_rightdf"])
pyber_data_df = pd.merge(ride_data_df, city_data_df, how="left", on=["city", "city"])
pyber_data_df.head()

,city,date,fare,ride_id,driver_count,type
0,Lake Jonathanshire,2019-01-14 10:14:22,13.83,5739410935873,5,Urban
1,South Michelleport,2019-03-04 18:24:09,30.24,2343912425577,72,Urban
2,Port Samanthamouth,2019-02-24 04:29:00,33.44,2005065760003,57,Urban
3,Rodneyfort,2019-02-10 23:22:03,23.44,5149245426178,34,Urban
4,South Jack,2019-03-06 04:28:35,34.58,3908451377344,46,Urban